package kr.ac.dongyang.ailabproj1;

import org.json.JSONArray;
import org.json.JSONException;

public class RestrauntDatas {

    public static String RestaurantsJson = "[\n" +
            " [\"1\", \"육회 바른 연어\", \"-1\", \"일식\", \"초밥\", \"육회덮밥\", \"육회초밥\", \"육연덮밥\"]," +
            " [\"2\", \"백남옥 달인 손만두\", \"4.6\", \"한식\", \"만두\", \"고기통만두\", \"김치통만두\", \"새우통만두\"],"+
            " [\"3\", \"푸라닭\", \"4.9\", \"한식\", \"치킨\", \"고추마요 치킨\", \"매드갈릭 치킨\", \"씬 후라이드\"]," +
            " [\"4\", \"또봉이 통닭&별난 만두\", \"4.9\", \"한식\", \"치킨\", \"순살 후라이드\", \"또봉이 통닭\", \"양념순살\"]," +
            " [\"5\", \"본죽&비빔밥\", \"5\", \"한식\", \"죽\", \"전복죽\", \"본나물비빔밥\", \"치즈 쉬림프 비빔 포케\"]," +
            " [\"6\", \"맥주 뚜껑\", \"-1\", \"야식\", \"주점\", \"나쵸\", \"한치\", \"반건조오징어\"]," +
            " [\"7\", \"동명\", \"5\", \"일식\", \"돈카츠\", \"모둠카츠\", \"우동\", \"카라아게동\"]," +
            " [\"8\", \"금별맥주\", \"-1\", \"야식\", \"주점\", \"토마토해장파스탕\", \"핫크리스피치킨\", \"칼칼 스키야키나베\"]," +
            " [\"9\", \"빙동댕\", \"5\", \"디저트\", \"빙수\", \"인절미빙수\", \"눈꽃팥빙수\", \"돼지바빙수\"]," +
            " [\"10\", \"동대문 엽기 떡볶이\", \"4.8\", \"한식\", \"떡볶이\", \"엽기떡볶이\", \"로제떡볶이\", \"마라떡볶이\"]," +
            " [\"11\", \"빡가네 갈비후라이\", \"5\", \"한식\", \"치킨\", \"갈비후라이\", \"양념갈비후라이\", \"양념갈비후라이이\"]," +
            " [\"12\", \"no more pizza\", \"5\", \"양식\", \"피자\", \"치즈피자\", \"페퍼로니피자\", \"에멘탈머쉬룸피자\"]," +
            " [\"13\", \"청년다방\", \"4.8\", \"한식\", \"떡볶이\", \"분향차돌떢볶이\", \"경양식돈가스\", \"통통순살치킨\"]," +
            " [\"14\", \"3층인데 괜찮아?\", \"-1\", \"야식\", \"주점\", \"한우대창 낙곱새\", \"마늘간장치킨\", \"철판 김삼숙\"]," +
            " [\"15\", \"iOTTOi\", \"4.9\", \"한식\", \"김밥\", \"오토김밥\", \"닭강정\", \"명란마요오니기리\"]," +
            " [\"16\", \"GGgo\", \"-1\", \"한식\", \"컵밥\", \"지지고누들\", \"참치마요컵밥\", \"불고기마요 컵밥\"]," +
            " [\"17\", \"베스킨 라빈스\", \"4.6\", \"디저트\", \"디저트\", \"엄마는 외계인\", \"아이스크림 케이크\", \"밀크쉐이크\"]," +
            " [\"18\", \"참이맛 감자탕&순대국\", \"-1\", \"한식\", \"국밥\", \"참이맛감자탕\", \"순대국\", \"묵은지보쌈\"]," +
            " [\"19\", \"옛날(꿀) 닭강정\", \"-1\", \"한식\", \"닭강정\", \"달콤한맛 닭강정\", \"옛날 통닭\", \"후라이드\"]," +
            " [\"20\", \"노랑통닭\", \"4.8\", \"한식\", \"치킨\", \"노랑 3종 세트\", \"엄청 큰 반반치킨\", \"매콤 직화 무뼈 닭발\"]," +
            " [\"21\", \"주궁\", \"-1\", \"야식\", \"주점\", \"닭한마리 우동\", \"부산물떡어묵탕\", \"무뼈국물닭발\"]," +
            " [\"22\", \"유가네 닭갈비\", \"4.9\", \"한식\", \"닭갈비\", \"유가네 닭갈비\", \"콘치즈 닭갈비\", \"치즈 퐁닭\"]," +
            " [\"23\", \"메가커피\", \"4.9\", \"디저트\", \"커피\", \"아메리카노\", \"허니브레드\", \"딸기라떼\"],\n" +
            " [\"24\", \"이삭 토스트\", \"4.8\", \"기타\", \"토스트\", \"소이 크런치 치킨 토스트\", \"리얼 양념치킨 토스트\", \"프렌치 햄치즈 토스트\"]," +
            " [\"25\", \"백소정\", \"4.9\", \"일식\", \"돈카츠\", \"돈카츠\", \"마제소바\", \"우나기온소바\"],\n" +
            " [\"26\", \"대보칼국수\", \"-1\", \"한식\", \"칼국수\", \"원조칼국수\", \"왕만두 4알\", \"얼크니 장칼국수\"]," +
            " [\"27\", \"롯데리아\", \"-1\", \"양식\", \"햄버거\", \"데리버거\", \"더블한우불고기 버거\", \"리아 새우버거\"]," +
            " [\"28\", \"교촌\", \"4.7\", \"한식\", \"치킨\", \"허니콤보\", \"교촌후라이드\", \"교촌양념치킨\"],\n" +
            " [\"29\", \"소매점 양꼬치\", \"4.9\", \"중식\", \"양꼬치\", \"양고기꼬치\", \"땡초닭근위무침\", \"매운닭발\"]," +
            " [\"30\", \"맘스터치\", \"4.6\", \"양식\", \"햄버거\", \"싸이버거\", \"그릴드더블비프버거\", \"케이준 떡강정\"]," +
            " [\"31\", \"비어펍\", \"-1\", \"야식\", \"주점\", \"명란크림파스타\", \"먹태\", \"감바스\"]," +
            " [\"32\", \"투썸플레이\", \"-1\", \"디저트\", \"커피\", \"아메리카노\", \"스트로베리 초콜릿 생크림 케이크\", \"콜드브루\"]," +
            " [\"33\", \"보드람 치킨\", \"4.9\", \"한식\", \"치킨\", \"오리지널 후라이드\", \"보드람 떡볶이\", \"골뱅이 소면\"]," +
            " [\"34\", \"고척동 삼겹살\", \"-1\", \"한식\", \"삼겹살\", \"삼겹살 무한리필\", \"숙성삼겹살\", \"우삼겹\"]," +
            " [\"35\", \"계림원 누릉지 통닭구이\", \"4.9\", \"한식\", \"치킨\", \"콘닭\", \"치즈콘닭\", \"누룽지통닭\"]," +
            " [\"36\", \"샐러리아\", \"4.9\", \"기타\", \"샐러드\", \"훈제오리 샐러드\", \"스팀 닭가슴살 포케\", \"목살 포케\"]," +
            " [\"37\", \"삼삼 치킨\", \"-1\", \"한식\", \"치킨\", \"후라이드\", \"간장치킨\", \"마늘치킨골뱅이세트\"]," +
            " [\"38\", \"리얼펍&살얼음맥주\", \"-1\", \"야식\", \"주점\", \"리얼 로제떡볶이\", \"킬바사 모둠소세지\", \"오꼬노미야끼\"]," +
            " [\"39\", \"호시타코야끼\", \"4.4\", \"일식\", \"타코야끼\", \"정통 타코야끼\", \"눈꽃치즈 타코야끼\", \"네기 타코야끼\"]," +
            " [\"40\", \"고좌리 뼈 칼국수\", \"-1\", \"한식\", \"칼국수\", \"뼈칼국수\", \"육회비빔밥\", \"직화뼈구이\"]," +
            " [\"41\", \"한라참치\", \"5\", \"일식\", \"참치\", \"한라참치 찹\", \"참다랑어\", \"한라스페셜\"]," +
            " [\"42\", \"양떼목장\", \"5\", \"중식\", \"양꼬치\", \"양꼬치\", \"고급양갈비\", \"칠리새우\"]," +
            " [\"43\", \"중식당 청이\", \"4.8\", \"중식\", \"짜장\", \"짜장면\", \"볶음짬뽕\", \"잡채밥\"]," +
            " [\"44\", \"고척돈까스\", \"-1\", \"한식\", \"돈까스\", \"고척돈까스\", \"우삼겹숙주덮밥\", \"주먹밥\"]," +
            " [\"45\", \"백채 김치찌개\", \"4.8\", \"한식\", \"김치찌개\", \"돼지김치찌개\", \"햄김치찌개\", \"통돼지두루치기\"]," +
            " [\"46\", \"엄마손 전집\", \"5\", \"한식\", \"모듬전\", \"모든전\", \"불고기뚝배기\", \"돌낙지덮밥\"]," +
            " [\"47\", \"나들이 아구찜\", \"-1\", \"한식\", \"아구찜\", \"아구찜\", \"해물탕\", \"낙지비빔밥\"]," +
            " [\"48\", \"도담국수\", \"-1\", \"한식\", \"국수\", \"어묵국수\", \"멸치국수\", \"비빔국수\"]," +
            " [\"49\", \"하우마라\", \"5\", \"중식\", \"마라탕\", \"마라탕\", \"마라샹궈\", \"꿔바로우\"]," +
            " [\"50\", \"난연스시\", \"-1\", \"일식\", \"초밥\", \"스시세트\", \"모듬회덮밥\", \"나가시끼짬뽕\"]," +
            " [\"51\", \"엄마손 생선구이\", \"-1\", \"한식\", \"생선구이\", \"모둠구이\", \"생선구이\", \"제육볶음\"]," +
            " [\"52\", \"꼭지식당\", \"-1\", \"한식\", \"찌개\", \"수제비\", \"콩비지\", \"황태북어국\"]," +
            " [\"53\", \"고척 칼국수\", \"-1\", \"한식\", \"칼국수\", \"멸치칼국수\", \"닭칼국수\", \"바지락칼국수\"]," +
            " [\"54\", \"별이 빛나는 밤에\", \"-1\", \"야식\", \"주점\", \"백숙\", \"생대구탕\", \"골뱅이소면\"]," +
            " [\"55\", \"써니네 맷돌 빈대떡\", \"4.5\", \"한식\", \"전\", \"고기녹두빈대떡\", \"해물파전\", \"굴전\"]," +
            " [\"56\", \"발발이 추억\", \"-1\", \"한식\", \"족발\", \"족발\", \"보쌈\", \"치즈불족\"]," +
            " [\"57\", \"오복 숯불 닭꼬치\", \"5\", \"일식\", \"닭꼬치\", \"숯불닭꼬치(소금구이맛)\", \"숯불닭꼬치(순한맛)\", \"숯불닭꼬치(매콤한맛)\"]," +
            " [\"58\", \"만포 돼지국밥, 순대국\", \"4.7\", \"한식\", \"국밥\", \"돼지국밥\", \"순대국\", \"돼지고기국수\"]," +
            " [\"59\", \"도연\", \"5\", \"일식\", \"스시\", \"특 대왕 연어초밥\", \"냉연어국수\", \"새우튀김우동\"]," +
            " [\"60\", \"육회지존\", \"4.9\", \"한식\", \"육회\", \"육회\", \"육회비빔밥\", \"육회초밥\"]," +
            " [\"61\", \"한솥\", \"4.43\", \"한식\", \"백반\", \"동백\", \"진달래\", \"치킨제육\"]," +
            " [\"62\", \"써브웨이\", \"4.9\", \"기타\", \"샌드위치\", \"이탈리안 비엠티\", \"에그마요\", \"스테이크&치즈\"]," +
            " [\"63\", \"매머드익스프레스\", \"4.9\", \"디저트\", \"커피\", \"아메리카노\", \"카페라떼\", \"우유 크림 크로슈\"]," +
            " [\"64\", \"역전우동\", \"4.9\", \"일식\", \"우동\", \"옛날우동\", \"냉모밀\", \"매콤치킨마요덮밥\"]," +
            " [\"65\", \"진민네 포차\", \"-1\", \"야식\", \"주점\", \"닭불구이\", \"떡구이\", \"쭈꾸미 볶음\"]," +
            " [\"66\", \"역전 할머니 맥주\", \"-1\", \"야식\", \"주점\", \"30cm롱치즈돈까스\", \"짜빠구리\", \"갈릭빠다포테이토\"]," +
            " [\"67\", \"와플대학\", \"4.9\", \"디저트\", \"와플\", \"오레오누텔라와플\", \"젤라또와플\", \"애플시나몬와플\"]," +
            " [\"68\", \"일품마라탕\", \"5\", \"중식\", \"마라탕\", \"마라탕\", \"마라비빔\", \"마라샹궈\"], " +
            " [\"69\", \"빨봉분식\", \"4.7\", \"한식\", \"떡볶이\", \"빨떡에 치즈추가\", \"쫄만두\", \"샐러드 우동\"], " +
            " [\"70\", \"홍콩반점\", \"4.7\", \"중식\", \"짜장\", \"고기짜장\", \"짬뽕\", \"탕수육\"], " +
            " [\"71\", \"빽다방\", \"-1\", \"디저트\", \"카페\", \"원조커피\", \"완전 초코\", \"빽스치노\"], " +
            " [\"72\", \"놀부 부대찌개&철판구이\", \"5\", \"한식\", \"부대찌개\", \"치즈닭갈비 철판\", \"쭈꾸미 철판\", \"놀부부대찌개\"], " +
            " [\"73\", \"대왕곱창\", \"4.8\", \"한식\", \"곱창\", \"곱창구이\", \"모듬구이\", \"막창구이\"], " +
            " [\"74\", \"대호네 식당\", \"-1\", \"한식\", \"백반\", \"백반\", \"김치찌개\", \"순두부찌개\"], " +
            " [\"75\", \"돈전성시\", \"5\", \"한식\", \"삼겹살\", \"숙성 육삼겹\", \"돼지갈비\", \"차돌된장찌개\"], " +
            " [\"76\", \"오븐마루\", \"4.8\", \"한식\", \"치킨\", \"바베큐로스트\", \"까르보 현미베이크\", \"바삭오리지널 현미베이크\"], " +
            " [\"77\", \"전가복\", \"4.8\", \"중식\", \"짜장\", \"짜장면\", \"삼선고추짬뽕\", \"볶음밥\"], " +
            " [\"78\", \"청남옥\", \"-1\", \"한식\", \"국밥\", \"순대국\", \"순대전골\", \"술국\"], " +
            " [\"79\", \"에뚜왈\", \"-1\", \"야식\", \"주점\", \"구절판\", \"세우장\", \"소불고기 무쌈\"], " +
            " [\"80\", \"지니네 밀크빙수\", \"5\", \"디저트\", \"빙수\", \"생딸기눈꽃밀빙\", \"인절미눈꽃밀빙\", \"트리플베리치즈눈꽃밀빙\"], " +
            " [\"81\", \"전주식당\", \"-1\", \"한식\", \"백반\", \"제육덮밥\", \"아무거나\", \"비빔밥\"], " +
            " [\"82\", \"마라공방\", \"4.9\", \"중식\", \"마라탕\", \"마라탕\", \"계란볶음밥\", \"꿔바로우\"], " +
            " [\"83\", \"컴포즈커피\", \"4.74\", \"디저트\", \"카페\", \"카페라떼\", \"사과생크림와플\", \"크로와상와플\"], " +
            " [\"84\", \"김밥왕국\", \"4.24\", \"한식\", \"분식\", \"돈까스\", \"김밥\", \"쫄면\"], " +
            " [\"85\", \"포차천국\", \"4.9\", \"야식\", \"주점\", \"곱도리탕\", \"원조치밥\", \"딸기블라썸화채\"], " +
            " [\"86\", \"스위치\", \"-1\", \"디저트\", \"카페\", \"구름커피\", \"풋풋청사과요거트스무디\", \"티라미수크레이프케익\"]" +
            "]";

//    public static String RestaurantsJson = "[\n" +
//            "  [1, \"맛있는 비빔밥집\", 4.3, \"한식\", \"비빔밥\", \"돌솥비빔밥\", \"불고기비빔밥\", \"김치찌개\"],\n" +
//            "  [2, \"우동나라\", 4.7, \"일식\", \"우동\", \"카케우동\", \"튀김우동\", \"냉우동\"],\n" +
//            "  [3, \"짜장명가\", 3.9, \"중식\", \"짜장면\", \"짜장면\", \"짬뽕\", \"탕수육\"],\n" +
//            "  [4, \"스테이크 하우스\", 4.8, \"양식\", \"스테이크\", \"립아이 스테이크\", \"필레 미뇽\", \"시저 샐러드\"],\n" +
//            "  [5, \"한식정식\", 4.1, \"한식\", \"한정식\", \"불고기\", \"된장찌개\", \"잡채\"],\n" +
//            "  [6, \"초밥천국\", 4.6, \"일식\", \"초밥\", \"연어초밥\", \"광어초밥\", \"참치초밥\"],\n" +
//            "  [7, \"탕수육달인\", 4.0, \"중식\", \"탕수육\", \"탕수육\", \"짜장면\", \"깐풍기\"],\n" +
//            "  [8, \"파스타앤피자\", 4.5, \"양식\", \"파스타\", \"까르보나라\", \"마르게리타 피자\", \"볼로네제\"],\n" +
//            "  [9, \"순대국밥집\", 3.8, \"한식\", \"국밥\", \"순대국밥\", \"내장탕\", \"공기밥\"],\n" +
//            "  [10, \"텐동명가\", 4.4, \"일식\", \"덴푸라\", \"새우텐동\", \"야채텐동\", \"튀김우동\"],\n" +
//            "  [11, \"중화요리집\", 4.2, \"중식\", \"중화요리\", \"마파두부\", \"고추잡채\", \"짜장면\"],\n" +
//            "  [12, \"양식레스토랑\", 4.7, \"양식\", \"양식\", \"립아이 스테이크\", \"치킨 파마산\", \"시저 샐러드\"],\n" +
//            "  [13, \"돌솥비빔밥집\", 4.3, \"한식\", \"비빔밥\", \"돌솥비빔밥\", \"된장찌개\", \"김치\"],\n" +
//            "  [14, \"우동천국\", 4.5, \"일식\", \"우동\", \"카케우동\", \"튀김우동\", \"냉우동\"],\n" +
//            "  [15, \"중식당\", 4.0, \"중식\", \"중식\", \"짬뽕\", \"짜장면\", \"탕수육\"],\n" +
//            "  [16, \"파스타가게\", 4.6, \"양식\", \"파스타\", \"알리오 올리오\", \"까르보나라\", \"볼로네제\"],\n" +
//            "  [17, \"김치찌개 전문점\", 4.1, \"한식\", \"찌개\", \"김치찌개\", \"된장찌개\", \"순두부찌개\"],\n" +
//            "  [18, \"초밥집\", 4.7, \"일식\", \"초밥\", \"연어초밥\", \"광어초밥\", \"참치초밥\"],\n" +
//            "  [19, \"탕수육맛집\", 4.3, \"중식\", \"탕수육\", \"탕수육\", \"깐풍기\", \"짜장면\"],\n" +
//            "  [20, \"피자헛\", 4.5, \"양식\", \"피자\", \"페퍼로니 피자\", \"마르게리타\", \"고르곤졸라\"],\n" +
//            "  [21, \"콩나물국밥\", 4.0, \"한식\", \"국밥\", \"콩나물국밥\", \"순두부찌개\", \"김치\"],\n" +
//            "  [22, \"덴푸라집\", 4.4, \"일식\", \"덴푸라\", \"새우덴푸라\", \"야채덴푸라\", \"튀김우동\"],\n" +
//            "  [23, \"중화요리 전문점\", 4.2, \"중식\", \"중화요리\", \"마파두부\", \"고추잡채\", \"짜장면\"],\n" +
//            "  [24, \"서양식당\", 4.6, \"양식\", \"양식\", \"스테이크\", \"파스타\", \"샐러드\"],\n" +
//            "  [25, \"불고기집\", 4.3, \"한식\", \"불고기\", \"불고기\", \"비빔밥\", \"된장찌개\"],\n" +
//            "  [26, \"일본라멘집\", 4.5, \"일식\", \"라멘\", \"돈코츠라멘\", \"쇼유라멘\", \"미소라멘\"],\n" +
//            "  [27, \"중국집\", 4.1, \"중식\", \"중식\", \"짜장면\", \"짬뽕\", \"탕수육\"],\n" +
//            "  [28, \"파스타집\", 4.7, \"양식\", \"파스타\", \"볼로네제\", \"알리오 올리오\", \"까르보나라\"],\n" +
//            "  [29, \"찌개전문점\", 4.0, \"한식\", \"찌개\", \"된장찌개\", \"김치찌개\", \"순두부찌개\"],\n" +
//            "  [30, \"스시집\", 4.6, \"일식\", \"초밥\", \"연어초밥\", \"참치초밥\", \"광어초밥\"],\n" +
//            "  [31, \"중식당2\", 4.2, \"중식\", \"중식\", \"고추잡채\", \"마파두부\", \"탕수육\"],\n" +
//            "  [32, \"스테이크하우스\", 4.7, \"양식\", \"스테이크\", \"립아이\", \"필레미뇽\", \"치킨 파마산\"],\n" +
//            "  [33, \"김치찌개집\", 4.1, \"한식\", \"찌개\", \"김치찌개\", \"된장찌개\", \"순두부찌개\"],\n" +
//            "  [34, \"라멘집\", 4.5, \"일식\", \"라멘\", \"돈코츠라멘\", \"쇼유라멘\", \"미소라멘\"],\n" +
//            "  [35, \"중식전문점\", 4.3, \"중식\", \"중식\", \"짜장면\", \"짬뽕\", \"탕수육\"],\n" +
//            "  [36, \"피자가게\", 4.6, \"양식\", \"피자\", \"마르게리타\", \"페퍼로니\", \"고르곤졸라\"],\n" +
//            "  [37, \"국밥집\", 4.0, \"한식\", \"국밥\", \"순대국밥\", \"내장탕\", \"공기밥\"],\n" +
//            "  [38, \"덴푸라집2\", 4.4, \"일식\", \"덴푸라\", \"새우덴푸라\", \"야채덴푸라\", \"튀김우동\"],\n" +
//            "  [39, \"중화요리집2\", 4.3, \"중식\", \"중식\", \"마파두부\", \"고추잡채\", \"탕수육\"],\n" +
//            "  [40, \"서양요리집\", 4.7, \"양식\", \"양식\", \"스테이크\", \"파스타\", \"샐러드\"]\n" +
//            "]";




    public String[] getRestrauntName(int index) {
        JSONArray restaurants = null;

        JSONArray rest = null;

        String name = null;
        String menu = null;
        try {

            restaurants = new JSONArray(RestaurantsJson);
            rest = restaurants.getJSONArray(index-1);
            name = rest.getString(1);
            menu = rest.getString(4);
        } catch (JSONException e) {
            throw new RuntimeException(e);
        }


        return new String[]{name, menu};
    }



}
